one4all_webserver/performance_test/basic.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 5000
      name: Warm up
    - duration: 20
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 60
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "Search"
    flow:
      - get:
          url: "/users/"
      - think: 5